<template>
	<div class="kit-blocks">
		<div class="container">
			<div class="kit-blocks__inner">
				<div class="kit-blocks__header">
					<h1 class="kit-blocks__title title title-h1">
						Блоки
					</h1>
				</div>

				<div class="kit-blocks__block">
					<div class="kit-blocks__block-header">
						<h2 class="kit-blocks__block-title title title-h2">
							Аккордеоны
						</h2>
					</div>

					<ColoredBlock>
						<div
							v-for="theme in AllBaseColors"
							:key="`kit-blocks__block-item-${theme}`"
							class="kit-blocks__block-item"
						>
							<Accordion :theme="theme">
								<template #header>
									Аккордеон {{ theme }}
								</template>

								Lorem ipsum dolor, sit amet consectetur adipisicing elit. Aliquam dolore commodi beatae eum, quasi totam, quaerat culpa error sint, officiis autem soluta sunt. Voluptatum fuga quisquam laudantium corrupti officia et sapiente, facilis voluptates reiciendis placeat adipisci ducimus odio quas ratione, consectetur quo quam illo in aliquid, corporis culpa. Laborum, quod!
							</Accordion>
						</div>
					</ColoredBlock>
				</div>

				<div class="kit-blocks__block">
					<div class="kit-blocks__block-header">
						<h2 class="kit-blocks__block-title title title-h2">
							Плеер синтеза реча - озвучка текста
						</h2>
					</div>

					<ColoredBlock>
						<div
							v-for="theme in AllBaseColors"
							:key="`kit-blocks__block-item-${theme}`"
							class="kit-blocks__block-item"
						>
							<SpeechSynthesisPlayer
								:theme="theme"
								:text="textToSpeach"
							/>
						</div>
					</ColoredBlock>
				</div>
			</div>
		</div>
	</div>
</template>

<script setup lang="ts">
import { AllBaseColors } from '~/types/common/Themes'

definePageMeta({
	layout: 'kit',
})

const textToSpeach = `
	Космическая физика и великие загадки Вселенной: от чёрных дыр до межзвёздных путешествий

	Фильм "Интерстеллар" не просто фантастика — это научно обоснованное путешествие в самые экстремальные уголки нашей Вселенной, где законы физики проявляются в самых невероятных формах. Современная космическая физика изучает явления, которые кажутся невозможными, но существуют благодаря фундаментальным принципам мироздания.

	Искривление пространства-время и чёрные дыры
	Центральный элемент фильма — сверхмассивная чёрная дыра Гаргантюа, изображённая с поразительной научной точностью. Реальные чёрные дыры, такие как Стрелец A в центре нашей галактики, обладают колоссальной гравитацией, способной искривлять пространство и замедлять время. Согласно Общей теории относительности Эйнштейна, около горизонта событий время для внешнего наблюдателя практически останавливается. Это означает, что космонавт, падающий в чёрную дыру, с точки зрения далёкого наблюдателя, никогда не достигнет её центра — его образ "замрёт" на границе.

	Аккреционный диск Гаргантюа в фильме светится из-за трения и нагрева вещества до миллионов градусов. В реальности так и происходит: падающая материя излучает в рентгеновском диапазоне, что позволяет астрономам обнаруживать чёрные дыры.

	Кротовые норы: гипотетические туннели в космосе
	"Интерстеллар" предлагает идею использования кротовой норы для мгновенного перемещения между звёздными системами. Теоретически такие "мосты" возможны, но для их стабилизации требуется экзотическая материя с отрицательной энергией. Пока учёные не нашли способа создать или обнаружить кротовые норы, но исследования в области квантовой гравитации и тёмной энергии дают надежду на новые открытия.

	Пятое измерение и гравитационные аномалии
	Один из самых загадочных моментов фильма — попадание Купера в тессеракт, где время становится физическим измерением. Современные теории, такие как М-теория, предполагают существование дополнительных измерений, свёрнутых в микроскопических масштабах. Если человечество научится взаимодействовать с ними, это откроет путь к управлению гравитацией и путешествиям через пространство-время.

	Тёмная материя и тёмная энергия
	Около 27% Вселенной состоит из тёмной материи, которая не излучает свет, но влияет на движение галактик. Ещё 68% — тёмная энергия, отвечающая за ускоренное расширение космоса. "Интерстеллар" косвенно затрагивает эту тему, показывая, как человечество сталкивается с неизвестными силами, пытаясь выжить. Разгадка этих тайн может перевернуть наше понимание физики и дать технологии для межзвёздных полётов.

	Будущее космических исследований
	Учёные уже сегодня работают над проектами, которые казались фантастикой ещё 50 лет назад:

	Искусственная гравитация (как в вращающемся модуле "Эндюранс")

	Криогенный сон для долгих космических перелётов

	Терраформирование планет вроде Марса

Космическая физика — это не только уравнения и теории. Это ключ к будущему человечества среди звёзд. Как сказал в фильме профессор Бранд: "Мы не хранители, а исследователи, странники, искатели приключений."
`
</script>

<style lang="scss">
$b: '.kit-blocks';

#{$b} {

  // .kit-blocks__header
  &__header {
    margin-bottom: 48px;
  }

  // .kit-blocks__block
  &__block {
    &:not(:last-child) {
      margin-bottom: 60px;
    }

    // .kit-blocks__block-header
    &-header {
      margin-bottom: 24px;
    }

    // .kit-blocks__block-item
    &-item {
      &:not(:last-child) {
        margin-bottom: 32px;
      }
    }
  }
}
</style>
